Tekla.Structures.Drawing.LeaderLine.LeaderLineTypes
The different types of leader lines available.

Tekla.Structures.Drawing.LeaderLine.LeaderLineTypes.Undefined
No type defined yet (this means that the leader line isn't selected yet).

Tekla.Structures.Drawing.LeaderLine.LeaderLineTypes.NormalLeaderLine
The standard leader line type. Its start point and elbow points can be freely modified.
The end point is read-only information.

Tekla.Structures.Drawing.LeaderLine.LeaderLineTypes.SupportLeaderLine
The support leader line type, used in reinforcement marks with parallel leader lines.
All leader line information is read-only.

Tekla.Structures.Drawing.LeaderLine.LeaderLineTypes.ExtensionLeaderLine
The type for the extension leader lines (enabled by the usage of an advanced option).
All leader line information is read-only.